PTT_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet_north
    {
        type            patch;
        nFaces          51;
        startFace       29340;
    }
    inlet_south
    {
        type            patch;
        nFaces          51;
        startFace       29391;
    }
    outlet_east
    {
        type            patch;
        nFaces          51;
        startFace       29442;
    }
    outlet_west
    {
        type            patch;
        nFaces          51;
        startFace       29493;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          480;
        startFace       29544;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          29682;
        startFace       30024;
    }
)

// ************************************************************************* //
